bench/pgbench-compare/results/20260512_162100_goopg_c100_j100_standard.txt
pgbench (18.3)
starting vacuum...end.
message type 0x5a arrived from server while idle
pgbench: error: client 86 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 91 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 42 command 4: no results
pgbench: error: client 52 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 44 command 4: no results
pgbench: error: client 7 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 70 command 4: no results
pgbench: error: client 87 command 4: no results
pgbench: error: client 0 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 33 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 74 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 93 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 18 command 4: no results
pgbench: error: client 89 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 97 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 13 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 11 command 4: no results
pgbench: error: client 59 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 92 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 32 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 20 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 29 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 17 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 14 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 6 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 67 command 4: no results
pgbench: error: client 21 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 30 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 57 command 4: no results
pgbench: error: client 25 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 61 command 4: no results
pgbench: error: client 54 command 4: no results
pgbench: error: client 64 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 96 command 4: no results
pgbench: error: client 16 command 4: no results
pgbench: error: client 53 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 24 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 22 command 4: no results
pgbench: error: client 3 command 4: no results
pgbench: error: client 48 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 90 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 2 command 4: no results
pgbench: error: client 75 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 35 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 85 command 4: no results
pgbench: error: client 39 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 68 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 55 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 43 command 4: no results
pgbench: error: client 83 command 4: no results
pgbench: error: client 26 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 66 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 15 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 27 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 9 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 77 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 50 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 10 command 4: no results
pgbench: error: client 23 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 31 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 34 command 4: no results
pgbench: error: client 4 command 4: no results
pgbench: error: client 65 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 82 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 63 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 60 command 4: no results
pgbench: error: client 1 command 4: no results
pgbench: error: client 49 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 99 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 41 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 62 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 51 command 4: no results
pgbench: error: client 94 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 69 command 4: no results
pgbench: error: client 47 command 4: no results
pgbench: error: client 45 command 4: no results
pgbench: error: client 95 command 4: no results
pgbench: error: client 56 command 4: no results
pgbench: error: client 36 command 4: no results
pgbench: error: client 40 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 84 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 5 command 4: no results
pgbench: error: client 98 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 37 command 4: no results
pgbench: error: client 58 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 76 command 4: no results
pgbench: error: client 12 command 4: no results
pgbench: error: client 88 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 80 command 4: no results
pgbench: error: client 81 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 8 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 46 command 4: no results
message type 0x5a arrived from server while idle
pgbench: error: client 79 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 71 command 4: no results
pgbench: error: client 78 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 19 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
[...]
pgbench: error: client 28 command 4: no results
pgbench: error: client 72 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 38 command 4: no results
message type 0x5a arrived from server while idle
message type 0x5a arrived from server while idle
pgbench: error: client 73 command 4: no results
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: simple
number of clients: 100
number of threads: 100
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 0
number of failed transactions: 252 (100.000%)
initial connection time = 50.240 ms
tps = 0.000000 (without initial connection time)
pgbench: error: Run was aborted; the above results are incomplete.