bench/pgbench-compare/results/20260515_231531_goopg_c100_j100_standard.txt
pgbench (18.3)
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 100
maximum number of tries: 1
duration: 1 s
number of transactions actually processed: 543
number of failed transactions: 7 (1.273%)
latency average = 189.693 ms
latency stddev = 61.191 ms
initial connection time = 53.779 ms
tps = 475.634881 (without initial connection time)